org/_posts/2013-10/2013-10-20-install-emacs24.org
#+BEGIN_HTML
---
layout: post
keywords: 
description: 
title: 安装Emacs24.3.1
categories: [Emacs]
tags: [Emacs]
group: archive
icon: code
featured: false
---
#+END_HTML
* 安装Emacs24.3.1
** 卸载Emacs23
之前用的Emacs是Ubuntu12.04系统apt-get下来的，要安装Emacs24.3.1需要先卸载掉。
#+BEGIN_SRC sh
sudo apt-get purge emacs23* emacs23-bin-common* emacs23-common* emacsen-common && sudo apt-get autoremove
#+END_SRC
** 安装Emacs24.3.1
用相对比较便捷的PPA方式安装
#+BEGIN_SRC sh
sudo add-apt-repository ppa:cassou/emacs
sudo apt-get update
sudo apt-get install emacs24 emacs24-el emacs24-common-non-dfsg
#+END_SRC
** 相关问题
安装Emacs24后，继续使用以前Emacs23的.emacs出现了点问题，记录如下

1.安装ELPA包管理器并安装扩展，Emacs启动报错“cannot open load file” for ~/.emacs.d/elpa/archives/-pkg

解决办法：touch ~/.emacs.d/elpa/archives/-pkg

2.启动Emacs报错Symbol's function definition is void: loop

解决办法：.emacs添加 (require 'cl) 

3.Emacs23中去掉工具栏菜单栏和滚动条的配置
#+BEGIN_SRC elisp
(tool-bar-mode nil)  
(menu-bar-mode nil)  
(scroll-bar-mode nil)  
#+END_SRC
Emacs24中上面的设置是无效的，需要改为
#+BEGIN_SRC elisp
(tool-bar-mode 0)  
(menu-bar-mode 0)  
(scroll-bar-mode 0)  
#+END_SRC
